W6D5/99_cats/app/controllers/cats_controller.rb

  def update
    @cat = Cat.find(params[:id])

    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "name" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["color", "purple"], ["name", "Larry update"], ["description", "The cat was mehadsfasdf"], ["updated_at", "2020-07-10 23:47:57.506633"], ["id", 3]]