W8D1/reddit_clone/app/controllers/subs_controller.rb

  def require_moderator!
    @sub = Sub.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @sub = Sub.find(params[:id])

    if @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "subs" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "subs"."id" = ?  [["title", "tips"], ["description", "no"], ["updated_at", "2020-07-20 23:09:44.579035"], ["id", 2]]

  def create
    @sub = Sub.new(sub_params)
    @sub.user_id = current_user.id

    if @sub.save
---
INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["description", "test123"], ["user_id", 8], ["created_at", "2020-07-20 22:13:36.839620"], ["updated_at", "2020-07-20 22:13:36.839620"]]